common/models/User.php

SELECT * FROM `user` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        //mencari user login berdasarkan IDnya dan hanya dicari 1.
        $user = User::findOne($id);

SELECT * FROM `user` WHERE `username`='admin'
---
    public static function findByUsername($username)
    {
        //mencari user login berdasarkan username dan hanya dicari 1.
        $user = User::find()->where(['username'=>$username])->one();